
/*****************************************************************************
File Name   :  test_no_gdb.c

Description :  测试无gdb 的情况下打印堆栈信息

     Author   :  changyukun

*****************************************************************************/



#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif



/*========== 头文件==============================================================================================*/
#include <stdio.h>
#include <stdlib.h>
#include <execinfo.h>
#include <signal.h>







/*========== 外部变量引用=======================================================================================*/






/*========== 宏定义==============================================================================================*/






/*========== 数据结构定义======================================================================================*/






/*========== 变量定义===========================================================================================*/
			






/*========== 函数实现===========================================================================================*/

//-------------------------------------------------------------------------------------------------
void dump(int signo)
{
#define MAX_CALLSTACK_DEPTH 30

	void* array[MAX_CALLSTACK_DEPTH];
	size_t size;
	char** strings;
	size_t i;

	size = backtrace (array,MAX_CALLSTACK_DEPTH);
	strings = backtrace_symbols (array, size);

	printf ("Obtained %zd stack frames.nm\n", size);

	for(i=0; i<size; i++)
		printf ("%d -->%p  ==>%s\n", i, array[i], strings[i]);

	free(strings);
	
#undef MAX_CALLSTACK_DEPTH
	exit(0);
}

//-------------------------------------------------------------------------------------------------
void dump_init(void)
{
	signal(SIGSEGV,&dump);
}







#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif


